{
  "WorkshopId": 2601889262,
  "Title": "Manticores of Qud",
  "Description": " [h1]\"Metal is [b]weak[/b], subject to [b]rust[/b] and [b]magnetism[/b]. [b]Flesh[/b] is the only path to salvation.\"\r\n    - High Vat-Seer Kleae, leader of the Tleila\r\n[/h1]\r\n\r\n[i]The ancient eaters of Qud were a technologically advanced society, and so they had augmented their bodies with technology for as long as they had recorded history. But not long before the collapse of the eaters, a new sect was formed; the Tleila. The Tleila were not concerned with any form of sanctity or limitations to technology, they had learned the ability to manipulate the forms of themselves and others at will. Creating advanced armies of living weapons and specialized servants, the Tleila marched forwards, subjugating other eaters and flesh-folding them according to the Tleila's will. However, the eaters were long since weak, nor alone; once the Tleila were discovered by eater society at large, and thus the travelers of the star-farer's quay, the Tleila were rapidly dismantled and executed. Unfortunately High Vat-Seer Kleae, predicting the fall of the Tleila, destroyed the Tleila's flesh-folding technology in a petty effort to permanently trap all the Tleila's designs in their new forms. They were dubbed the Manticores by the eaters, and allowed to live so long as they reveal no further allegiance to the Tleila. Most manticores perished over time, but some were genetically stable and could even reproduce; others were functionally immortal. However it occurred, Manticores are still alive to this day in Qud, albeit in small numbers.[/i]\r\n\r\nThis mod adds a new playable race to Qud, the Manticores. Manticores are a minorly mutated, highly genetically designed subspecies of eaters. At character generation, Manticores get to choose a small amount of mutations, are able to use cybernetics, and can design their body plan at will. Sufficiently complex body plans will cause a toughness penalty at startup. \r\n\r\nDue to the complexity of the limb system in Qud, designing a body can have unexpected pitfalls. \r\n[list]\r\n[*]First, and most run-ending, is that you must be sure to give your character a pair of feet if they do not have them. Failing to do so will result in a massive movement penalty, which can easily kill a character. \r\n[*]Second, you cannot add a pair of hands slot directly. Instead, adding two of the same type of hand will add such a slot automatically. \r\n[*]Third, missile weapons require a hand of the same laterality to automatically be added. The majority of body plans have a left and right missile weapon- add a left hand and a right hand in order to add the matching missile weapons. You can change the missile weapon and then the hand's laterality in order to change them both. \r\n[*]Finally, there are some important attributes on limbs; \r\n[list]\r\n[*][S] means a limb is \"supporting\". This means it is responsible for keeping a certain imaginary limb platform intact. \r\n[*][D] means a limb is dependent, meaning it will be automatically removed if the imaginary limb platform it depends on is not supported. \r\n[*][R] means requires part, which means a part will be automatically removed if all parts of a certain type are removed. [R] may involve laterality, but does not need to. \r\n[*]Finally, [noparse][I][/noparse] means implied. An implied part will be automatically added to the body plan if the parts it is implied by are added. So far the only implied parts are pair of hands variations, and they are implied by 2 hands each. \r\n[/list]\r\n[/list]\r\nBeyond these rules, experiment with different body plans and find out how they affect gameplay and your usual gameplay strategies! Github link: https://github.com/PROMETHIA-27/ManticoresOfQud",
  "Tags": "Genotype",
  "Visibility": "2",
  "ImagePath": "preview.png"
}